wmy2370cn/nxp-lpc/NXP-LPC/RT-Thread/bsp/lpc2468/nic_bsp.c
rt_err_t lpc24xxether_tx( rt_device_t dev, struct pbuf* p)
{
	/* lock tx operation */ 
	rt_sem_take(&tx_sem, RT_WAITING_FOREVER); 
	lpc24xxether_write_frame (p); 
	rt_sem_release(&tx_sem);
	return 0;
}
#if 0
void lpc24xxether_read_frame(rt_uint8_t* ptr, rt_uint32_t section_length, rt_uint32_t total)
{
	rt_uint32_t RxProduceIndex = MAC_RXPRODUCEINDEX;
	rt_uint32_t RxConsumeIndex = MAC_RXCONSUMEINDEX;	 
	 rt_uint8_t* src_ptr   = (rt_uint8_t *)(rb_descriptors[RxConsumeIndex].Packet );
	memcpy(&ptr[ 0 ], &src_ptr[0], section_length);
	
	Rx_Stat[MAC_RXCONSUMEINDEX].Info     = 0;                       //Clear status for debugging purposes                      */

	/* move to the next frame. */
	MAC_RXCONSUMEINDEX      = (MAC_RXCONSUMEINDEX + 1) % NUM_RX_FRAG;     
}
#endif

void lpc24xxether_read_frame(rt_uint8_t* ptr, rt_uint32_t section_length, rt_uint32_t total)
{
	register rt_uint32_t buf_remain, section_remain;
	static rt_uint32_t  buf_offset = 0, frame_read = 0;
	static rt_uint8_t* src_ptr = RT_NULL;
	rt_uint32_t section_read = 0;

	rt_uint32_t RxProduceIndex = MAC_RXPRODUCEINDEX;
	rt_uint32_t RxConsumeIndex = MAC_RXCONSUMEINDEX;	 

	src_ptr = (rt_uint8_t *)(rb_descriptors[RxConsumeIndex].Packet );
	/* Loop until we have obtained the required amount of data. */
	
	while( section_read < section_length )
	{
		buf_remain = (total - buf_offset);
		section_remain = section_length - section_read;

		if( section_remain > buf_remain )
		{//目标空间够大
			/* more data on section than buffer size */
			memcpy(&ptr[ section_read ], &src_ptr[buf_offset], buf_remain);
			section_read += buf_remain;
			frame_read += buf_remain;

			/* free buffer */
			Rx_Stat[MAC_RXCONSUMEINDEX].Info     = 0;                       //Clear status for debugging purposes                      */

			/* move to the next frame. */
			MAC_RXCONSUMEINDEX      = (MAC_RXCONSUMEINDEX + 1) % NUM_RX_FRAG;     

			/* Reset the variables for the new buffer. */
			src_ptr = (rt_uint8_t *)(rb_descriptors[MAC_RXCONSUMEINDEX].Packet );
			buf_offset = 0;
		}
		else
		{
			/* more data on buffer than section size */
			memcpy(&ptr[section_read], &src_ptr[buf_offset], section_remain);
			buf_offset += section_remain;
			section_read += section_remain;
			frame_read += section_remain;

			/* finish this read */
			if((frame_read >= total) || (buf_offset >= ETH_FRAG_SIZE))
			{
				/* free buffer */
				Rx_Stat[MAC_RXCONSUMEINDEX].Info     = 0;                       //Clear status for debugging purposes                      */

				/* move to the next frame. */
				MAC_RXCONSUMEINDEX      = (MAC_RXCONSUMEINDEX + 1) % NUM_RX_FRAG;     

				src_ptr = (rt_uint8_t*)(rb_descriptors[MAC_RXCONSUMEINDEX].Packet );
				buf_offset = 0;
			}
		}
	}
} 


rt_uint16_t get_nic_rx_frame_size (void)
{
	rt_uint16_t     rxconsumeix;
	rt_uint16_t     rxproduceix;
	rt_uint16_t     desc_cnt=0 , i =0;
	rt_uint16_t     rx_frame_size = 0;
	rt_uint32_t   rxstatus;
	rt_uint8_t   flag = RT_FALSE;

	rt_uint32_t  nRsv =  MAC_RSV;
	rt_uint32_t  nSta =  MAC_STATUS;


	rxconsumeix =   MAC_RXCONSUMEINDEX;
	rxproduceix =   MAC_RXPRODUCEINDEX;
	if (rxconsumeix == rxproduceix )
	{
		return rx_frame_size;
	}

	if (rxproduceix < rxconsumeix) 
	{ /* If the produce index has wrapped around                  */
		desc_cnt   =   NUM_RX_FRAG - rxconsumeix + rxproduceix;
	}
	else
	{ /* If consumeix is < produceix, then no wrap around occured */
		desc_cnt   =   rxproduceix - rxconsumeix;	
	}

	for (i = rxconsumeix;  ; i++)
	{
		rxstatus   =  Rx_Stat[i].Info;   
		rxstatus       &= (RINFO_NO_DESCR    |                       /* Obtain the descriptor error bits                         */
			RINFO_OVERRUN    |
			RINFO_ALIGN_ERR  |
			RINFO_LEN_ERR    |
			RINFO_SYM_ERR    |
			RINFO_CRC_ERR    |
			RINFO_FAIL_FILT);

		if (rxstatus > 0)
			break;			 
		else
		{
			rx_frame_size  =  Rx_Stat[i].Info & RINFO_SIZE;
			rx_frame_size  -= 3;

			if (rxstatus | RINFO_LAST_FLAG)
			{//最后一封
				break;
			}				 
		}
		if (rxproduceix > rxconsumeix)
		{
			if (i >= rxproduceix) //到头了
				break;
		}
		else
		{
			if (i >= NUM_RX_FRAG-1)
			{
				i = 0;
				flag = RT_TRUE;
			}
			if (flag && i >= rxproduceix)
				break;		
		}					
	}
	return rx_frame_size;
}

rt_uint8_t  is_pkt_size_valid (rt_uint16_t  size)
{
	rt_uint8_t  valid;

	valid = RT_TRUE;

	if (size  < 60)
	{
		valid = RT_FALSE;
	}

	if (size  > 1514+4) 
	{
		valid = RT_FALSE;
	}

	return (valid);
}

struct pbuf *lpc24xxether_rx(rt_device_t dev)
{	
	struct pbuf *p = RT_NULL;

	rt_uint32_t RxProduceIndex = MAC_RXPRODUCEINDEX;
	rt_uint32_t RxConsumeIndex = MAC_RXCONSUMEINDEX;	 

	struct pbuf* q;
	rt_uint16_t  pkt_len = 0;
	rt_uint16_t  pkt_cnt = 0;
	rt_uint8_t   ret = RT_FALSE;

	if (RxProduceIndex == RxConsumeIndex)
		return RT_NULL;

	pkt_len = get_nic_rx_frame_size();
	//判断一下 pkt_len 是否有效，如果无效，则丢弃
	ret = is_pkt_size_valid(pkt_len);
	if (ret == RT_FALSE)
	{
		rxpkt_discard();
		return NULL;
	}

	//
	if (pkt_len)
	{
		p = pbuf_alloc(PBUF_LINK, pkt_len, PBUF_RAM);
		if(p != RT_NULL && pkt_len == p->len)
		{
			SetLed(1,TRUE);
//			lpc24xxether_read_frame(p->payload, p->len, pkt_len);
 			for(q = p; q != RT_NULL; q= q->next)
 				lpc24xxether_read_frame(q->payload, q->len, pkt_len);
			SetLed(1,FALSE);
		}
		else
		{//如果内存申请不到，那么需要对描述符进行处理，扔掉部分数据包
			//rt_kprintf("no memory in pbuf\n");
			rxpkt_discard();		 
		}
	}

	return p;
}
 /*********************************************************************************************************
** 函数名称: set_mac_id
** 函数名称: set_mac_id
**
** 功能描述：  设置芯片物理地址,物理地址已经存储在程序空间内 
**
** 输　入:  
**          
** 输　出:   void
**         
** 全局变量:  
** 调用模块: 无
**
** 作　者:  LiJin
** 日　期:  2009年7月30日
** 备  注:  
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
** 备  注: 
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
 void set_mac_id( )   
{
	MAC_SA0   =  (lpc24xx_device.dev_addr[5] << 8) |(lpc24xx_device.dev_addr[4]);    /* Write the MAC Address, octect 2 and 1 to the EMAC        */
	MAC_SA1   =  (lpc24xx_device.dev_addr[3] << 8) |(lpc24xx_device.dev_addr[2]);    /* Write the MAC Address, octect 4 and 3 to the EMAC        */
	MAC_SA2  =  (lpc24xx_device.dev_addr[1] << 8) | (lpc24xx_device.dev_addr[0]);    /* Write the MAC Address, octect 6 and 5 to the EMAC        */
}
/*********************************************************************************************************
** 函数名称: lpc24xxether_register
** 函数名称: lpc24xxether_register
**
** 功能描述：  注册MAC设备
**
** 输　入:  char * name
**          
** 输　出:   int
**         
** 全局变量:  
** 调用模块: 无
**
** 作　者:  LiJin
** 日　期:  2009年7月30日
** 备  注:  
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
** 备  注: 
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
int lpc24xxether_register(char *name)
{
	rt_err_t result;

	/* init rt-thread device interface */
	lpc24xx_device.parent.parent.init		= rt_lpc24xxether_init;
	lpc24xx_device.parent.parent.open		= rt_lpc24xxether_open;
	lpc24xx_device.parent.parent.close		= rt_lpc24xxether_close;
	lpc24xx_device.parent.parent.read		= rt_lpc24xxether_read;
	lpc24xx_device.parent.parent.write		= rt_lpc24xxether_write;
	lpc24xx_device.parent.parent.control	= rt_lpc24xxether_control;
	lpc24xx_device.parent.parent.private    = RT_NULL;

	lpc24xx_device.parent.eth_rx			= lpc24xxether_rx;
	lpc24xx_device.parent.eth_tx			= lpc24xxether_tx;

	/* Update MAC address */
 	updata_mac_addr();
// 	/* update mac address */
// 	update_mac_address(lpc24xx_device);
 
	rt_sem_init(&tx_sem, "emac", 1, RT_IPC_FLAG_FIFO);
	result = eth_device_init(&(lpc24xx_device.parent), (char*)name);
	RT_ASSERT(result == RT_EOK);
	return RT_EOK;
}


void rt_hw_eth_init(void)
{
	lpc24xxether_register("E0");	 
}

